PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
    return mqtt_manager_publish(response_topic, response_data, strlen(response_data), 1, false);
}

esp_err_t mqtt_manager_clear_panel_config(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        memset(ctx->client_panel_id, 0, sizeof(ctx->client_panel_id));
        memset(ctx->panel_id, 0, sizeof(ctx->panel_id));
        
        xSemaphoreGive(ctx->mutex);
        
        LOG_I(TAG, "Panel configuration cleared");
        return ESP_OK;
    }
    
    return ESP_ERR_TIMEOUT;
}

esp_err_t mqtt_manager_emergency_memory_cleanup(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    LOG_W(TAG, "Performing emergency memory cleanup");
    
    if (ctx->pending_messages) {
        mqtt_pending_message_t dummy_msg;
        int cleared = 0;
        while (xQueueReceive(ctx->pending_messages, &dummy_msg, 0) == pdTRUE && cleared < 5) {
            cleared++;
        }
        if (cleared > 0) {
            LOG_I(TAG, "Cleared %d pending messages", cleared);
        }
    }
    
    for (int i = 0; i < 3; i++) {
        if (ctx->buffer_in_use[i]) {
            LOG_W(TAG, "Force releasing buffer %d", i);
            ctx->buffer_in_use[i] = false;
        }
    }
    
    size_t free_after = esp_get_free_heap_size();
    LOG_I(TAG, "Memory cleanup completed, free heap: %zu", free_after);
    
    return ESP_OK;
}

esp_err_t mqtt_manager_send_heartbeat(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (!mqtt_manager_is_connected() || strlen(ctx->esp32_id) == 0) {
        return ESP_ERR_INVALID_STATE;
    }
    
    char heartbeat_topic[MQTT_TOPIC_MAX_LENGTH];
    char heartbeat_data[256];
    
    snprintf(heartbeat_topic, sizeof(heartbeat_topic), "esp32/heartbeat/%s", ctx->esp32_id);
    
    int64_t timestamp_ms;
    if (time_manager_is_synchronized()) {
        timestamp_ms = (int64_t)time_manager_get_time() * 1000;
    } else {
        timestamp_ms = esp_timer_get_time() / 1000;
    }
    
    size_t free_heap = esp_get_free_heap_size();
    size_t min_heap = esp_get_minimum_free_heap_size();
    
    snprintf(heartbeat_data, sizeof(heartbeat_data),
             "{\"esp32_id\":\"%s\",\"timestamp\":%lld,\"free_heap\":%zu,\"min_heap\":%zu,\"uptime\":%lld}",
             ctx->esp32_id, (long long)timestamp_ms, free_heap, min_heap, 
             (long long)(esp_timer_get_time() / 1000000));
    
    return mqtt_manager_publish(heartbeat_topic, heartbeat_data, strlen(heartbeat_data), 1, false);
}